; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_10_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 - counter
	)
  (:init
		(= (value c0) 43)
	(= (value c1) 0)
	(= (value c2) 7)
	(= (value c3) 59)
	(= (value c4) 59)
	(= (value c5) 56)
	(= (value c6) 49)
	(= (value c7) 7)
	(= (value c8) 24)
	(= (value c9) 22)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
		)
	)
)

; plan
1. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 3 of 9
2. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 3 of 9
3. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 3 of 9
4. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 3 of 9
5. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 3 of 9
6. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 3 of 9
7. (increment c4)
   changed: (value c4) from 59 to 60
   goals met: 4 of 9
8. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 4 of 9
9. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 4 of 9
10. (increment c9)
   changed: (value c9) from 22 to 25
   goals met: 5 of 9
11. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 5 of 9
12. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 5 of 9
13. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 5 of 9
14. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 5 of 9
15. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 5 of 9
16. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 5 of 9
17. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 5 of 9
18. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 5 of 9
19. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 5 of 9
20. (increment c7)
   changed: (value c7) from 7 to 12
   goals met: 5 of 9
21. (increment c7)
   changed: (value c7) from 12 to 17
   goals met: 5 of 9
22. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 5 of 9
23. (increment c7)
   changed: (value c7) from 17 to 23
   goals met: 5 of 9
24. (increment c7)
   changed: (value c7) from 23 to 29
   goals met: 4 of 9
25. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 4 of 9
26. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 4 of 9
27. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 4 of 9
28. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 4 of 9
29. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 4 of 9
30. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 4 of 9
31. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 4 of 9
32. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 4 of 9
33. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 4 of 9
34. (increment c1)
   changed: (value c1) from 0 to 6
   goals met: 4 of 9
35. (increment c1)
   changed: (value c1) from 6 to 12
   goals met: 3 of 9
36. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 3 of 9
37. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 3 of 9
38. (increment c1)
   changed: (value c1) from 12 to 20
   goals met: 3 of 9
39. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 3 of 9
40. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 3 of 9
41. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 3 of 9
42. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 3 of 9
43. (increment c2)
   changed: (value c2) from 7 to 9
   goals met: 3 of 9
44. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 3 of 9
45. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 3 of 9
46. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 3 of 9
47. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 3 of 9
48. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 3 of 9
49. (increment c6)
   changed: (value c6) from 49 to 54
   goals met: 3 of 9
50. (increment c6)
   changed: (value c6) from 54 to 59
   goals met: 4 of 9
51. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 4 of 9
52. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 4 of 9
53. (decrement c0)
   changed: (value c0) from 43 to 38
   goals met: 4 of 9
54. (decrement c0)
   changed: (value c0) from 38 to 33
   goals met: 4 of 9
55. (decrement c0)
   changed: (value c0) from 33 to 28
   goals met: 4 of 9
56. (decrement c0)
   changed: (value c0) from 28 to 23
   goals met: 4 of 9
57. (decrement c0)
   changed: (value c0) from 23 to 18
   goals met: 5 of 9
58. (increment c2)
   changed: (value c2) from 9 to 11
   goals met: 5 of 9
59. (decrement c1)
   changed: (value c1) from 20 to 10
   goals met: 5 of 9
60. (decrement c0)
   changed: (value c0) from 18 to 13
   goals met: 5 of 9
61. (decrement c0)
   changed: (value c0) from 13 to 8
   goals met: 6 of 9
62. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 6 of 9
63. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 6 of 9
64. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 6 of 9
65. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 6 of 9
66. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 6 of 9
67. (increment c5)
   changed: (value c5) from 56 to 60
   goals met: 5 of 9
68. (increment c5)
   changed: (value c5) from 60 to 64
   goals met: 6 of 9
69. (decrement c7)
   changed: (value c7) from 29 to 19
   goals met: 7 of 9
70. (decrement c6)
   changed: (value c6) from 59 to 49
   goals met: 7 of 9
71. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 7 of 9
72. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 7 of 9
73. (increment c6)
   changed: (value c6) from 49 to 59
   goals met: 7 of 9
74. (decrement_rate c6)
   changed: (rate_value c6) from 10 to 9
   goals met: 7 of 9
75. (increment c7)
   changed: (value c7) from 19 to 29
   goals met: 6 of 9
76. (increment c6)
   changed: (value c6) from 59 to 68
   goals met: 7 of 9
77. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 7 of 9
78. (increment c7)
   changed: (value c7) from 29 to 39
   goals met: 7 of 9
79. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 7 of 9
80. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 7 of 9
81. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 7 of 9
82. (increment c8)
   changed: (value c8) from 24 to 27
   goals met: 6 of 9
83. (increment c9)
   changed: (value c9) from 25 to 28
   goals met: 7 of 9
84. (increment c8)
   changed: (value c8) from 27 to 30
   goals met: 6 of 9
85. (increment c9)
   changed: (value c9) from 28 to 31
   goals met: 7 of 9
86. (increment c7)
   changed: (value c7) from 39 to 49
   goals met: 7 of 9
87. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 7 of 9
88. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 7 of 9
89. (increment c8)
   changed: (value c8) from 30 to 35
   goals met: 6 of 9
90. (increment c8)
   changed: (value c8) from 35 to 40
   goals met: 6 of 9
91. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 6 of 9
92. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 6 of 9
93. (increment c9)
   changed: (value c9) from 31 to 36
   goals met: 6 of 9
94. (increment c9)
   changed: (value c9) from 36 to 41
   goals met: 7 of 9
95. (increment c8)
   changed: (value c8) from 40 to 45
   goals met: 6 of 9
96. (increment c9)
   changed: (value c9) from 41 to 46
   goals met: 7 of 9
97. (increment c8)
   changed: (value c8) from 45 to 50
   goals met: 7 of 9
98. (increment c9)
   changed: (value c9) from 46 to 51
   goals met: 8 of 9
99. (increment c7)
   changed: (value c7) from 49 to 59
   goals met: 7 of 9
100. (increment c8)
   changed: (value c8) from 50 to 55
   goals met: 6 of 9
101. (increment c9)
   changed: (value c9) from 51 to 56
   goals met: 7 of 9
102. (increment c8)
   changed: (value c8) from 55 to 60
   goals met: 7 of 9
103. (increment c9)
   changed: (value c9) from 56 to 61
   goals met: 8 of 9
104. (increment c7)
   changed: (value c7) from 59 to 69
   goals met: 8 of 9
105. (increment c8)
   changed: (value c8) from 60 to 65
   goals met: 7 of 9
106. (increment c9)
   changed: (value c9) from 61 to 66
   goals met: 8 of 9
107. (increment c8)
   changed: (value c8) from 65 to 70
   goals met: 8 of 9
108. (increment c9)
   changed: (value c9) from 66 to 71
   goals met: 9 of 9
